# St7GetNumBXSLoopsAndPlates

Returns the number of loops and plates in the specified BXS.

long St7GetNumBXSLoopsAndPlates(long uID, long PropNum, long* NumLoops,

long* NumPlates)

Input Parameters

uID

Strand7 model file ID.

PropNum

BXS property number.

Output Parameters
NumLoops

Number of loops in the BXS.

NumPlates

Number of plates in the BXS.